#line 2 "cs_test%_c_int00_test0%cs_error"
/* _c_int00_test0.c */
#ifndef ___c_int00_test0__
#define ___c_int00_test0__

#include "../factory/factory.h"

#include "_c_int00_test0.h"

void CS_TEST _c_int00_test0()
{
	/*Do not modify CS_TEST_PARAMETER()*/
	CS_TEST_PARAMETER(_c_int00_test0);
	/*Do not remove connect_stub_configuration()*/
	int cs_stub_connect_function_call = connect__c_int00_test0_stub_configuration();
	{/*<START TEST>*/

#line 1 "cs_test%_c_int00_test0%User code start"
#define MAX_DI 8
#define MAX_PI 2
#define MAX_DO 6
#define MAX_CONFIG 6
typedef struct _SigDI_t
{
	//	Current Signal Value Status
	uint8_t		nValue;					//	0: Low / 1: High
	uint32_t	nRemainTime;			//	msec : ?? ???? ???? ??? ???? ?©£?. ( 100 ~ 65000 )
} SigDI_t, *PSigDI_t;

typedef struct _SigPI_t
{
	//	Current Signal Value Status
	uint16_t	nFreqency;				//	0: No Signal / 1 ~ 4000 Hz : Pulse Value

} SigPI_t, *PSigPI_t;

static volatile struct g_sciTransfer
{
    uint32   mode;         /* Used to check for TX interrupt Enable */  
    uint32   tx_length;    /* Transmit data length in number of Bytes */
	uint32   rx_length;    /* Receive data length in number of Bytes */  
    uint8    * tx_data;    /* Transmit data pointer */  	
    uint8    * rx_data;    /* Receive data pointer */  
} g_sciTransfer_t[2U];
uint32_t g_nTick ;	//	???? Tick

uint32_t g_nTickBase ;	//	???? Tick Base ( 0 / 200000 / 400000 / ... )

uint32_t g_s_nTick ;	//	Tick ( 0 ~ 200000 )
#define rtiCOMPARE0 0U

uint32_t	g_tickPIEdge[4];	//	Time Stamp PI Edge
uint32_t	g_nOldPI[4];		//	Old PI Value

static int sum[3]={0,};
static uint32 s_het1pwmPolarity[8U] =
{
    3U,
    1U,
    3U,
    3U,
    3U,
    1U,
    3U,
    3U,
};

static uint32 s_het2pwmPolarity[8U] =
{
    3U,
    3U,
    3U,
    3U,
    3U,
    3U,
    3U,
    3U,
};

uint8_t DIN_STAT[8];
uint8_t DIN_MON[8];

uint8_t DO_FB[7];
double	PI_STAT[MAX_PI];
double	PI_MON[MAX_PI];
int8_t		g_pinDI[MAX_DI];		//	GPIO DI Value	( Pin Value )
uint16_t	g_pinPI[MAX_PI];		//	PI Value		( Pin Value )
int8_t		g_pinDO[MAX_DO];		//	GPIO DO Value	( Pin Value )

int8_t		g_pinDIMsk[MAX_DI];		//	GPIO DI Manual Set Mask
int8_t		g_pinPIMsk[MAX_PI];		//	Pulse PI Manual Set Mask
int8_t		g_pinDOMsk[MAX_DO];		//	GPIO DO Manual Set Mask

SigDI_t		g_sigDI[MAX_DI];		//	sigDI#1 ~ #8
SigPI_t		g_sigPI[MAX_PI];		//	sigPI#1 ~ #2
uint8_t		dataRx1[8];
int			g_bEnDOMonitor;
int			g_bEnHalt;
int g_canRxComp0;
int g_canRxComp1;
int g_canRxComp2;
int g_canRxComp3;
char	g_sConfBuf[MAX_CONFIG][128];
char 	g_sConfData[1024];			//	Config Data Buffer



typedef volatile struct pinMuxBase
{
    uint32 PINMMR0;		/**< 0xEB10 Pin Mux 0 register*/
    uint32 PINMMR1;		/**< 0xEB14 Pin Mux 1 register*/
    uint32 PINMMR2;		/**< 0xEB18 Pin Mux 2 register*/
    uint32 PINMMR3;		/**< 0xEB1C Pin Mux 3 register*/
    uint32 PINMMR4;		/**< 0xEB20 Pin Mux 4 register*/
    uint32 PINMMR5;		/**< 0xEB24 Pin Mux 5 register*/
    uint32 PINMMR6;		/**< 0xEB28 Pin Mux 6 register*/
    uint32 PINMMR7;		/**< 0xEB2C Pin Mux 7 register*/
    uint32 PINMMR8;		/**< 0xEB30 Pin Mux 8 register*/
    uint32 PINMMR9;		/**< 0xEB34 Pin Mux 9 register*/
    uint32 PINMMR10;		/**< 0xEB38 Pin Mux 10 register*/
    uint32 PINMMR11;		/**< 0xEB3C Pin Mux 11 register*/
    uint32 PINMMR12;		/**< 0xEB40 Pin Mux 12 register*/
    uint32 PINMMR13;		/**< 0xEB44 Pin Mux 13 register*/
    uint32 PINMMR14;		/**< 0xEB48 Pin Mux 14 register*/
    uint32 PINMMR15;		/**< 0xEB4C Pin Mux 15 register*/
    uint32 PINMMR16;		/**< 0xEB50 Pin Mux 16 register*/
    uint32 PINMMR17;		/**< 0xEB54 Pin Mux 17 register*/
    uint32 PINMMR18;		/**< 0xEB58 Pin Mux 18 register*/
    uint32 PINMMR19;		/**< 0xEB5C Pin Mux 19 register*/
    uint32 PINMMR20;		/**< 0xEB60 Pin Mux 20 register*/
    uint32 PINMMR21;		/**< 0xEB64 Pin Mux 21 register*/
    uint32 PINMMR22;		/**< 0xEB68 Pin Mux 22 register*/
    uint32 PINMMR23;		/**< 0xEB6C Pin Mux 23 register*/
    uint32 PINMMR24;		/**< 0xEB70 Pin Mux 24 register*/
    uint32 PINMMR25;		/**< 0xEB74 Pin Mux 25 register*/
    uint32 PINMMR26;		/**< 0xEB78 Pin Mux 26 register*/
    uint32 PINMMR27;		/**< 0xEB7C Pin Mux 27 register*/
    uint32 PINMMR28;		/**< 0xEB80 Pin Mux 28 register*/
    uint32 PINMMR29;		/**< 0xEB84 Pin Mux 29 register*/
    uint32 PINMMR30;		/**< 0xEB88 Pin Mux 30 register*/
}pinMuxBASE_t;
typedef volatile struct pinMuxKicker
{
    uint32 KICKER0;       /* kicker 0 register */
    uint32 KICKER1;       /* kicker 1 register */
} pinMuxKICKER_t;
extern pinMuxBASE_t *pinMuxReg_tmp;
extern pinMuxKICKER_t *kickerReg_tmp;


extern volatile uint32 *address_0xFFFF0400U;
extern volatile uint32 *address_0xFFFF040CU;
extern volatile uint32 *address_0xFFFFE400U;
extern volatile uint32 *address_0xFFFFE440U;
extern volatile uint32 *address_0xFFFFE404U;
extern volatile uint32 *address_0xFFFFE444U;
extern volatile uint32 *address_0xFFFFE408U;
extern volatile uint32 *address_0xFFFFE448U;
extern volatile uint32 *address_0xFFFFE40CU;
extern volatile uint32 *address_0xFFFFE44CU;
extern volatile uint32 *address_0xFFFFE410U;
extern volatile uint32 *address_0xFFFFE450U;
extern volatile uint32 *address_0xFFFFE540U;
extern volatile uint32 *address_0xFFFFE550U;
extern volatile uint32 *address_0xFFFFE530U;
